In [5]:
#Pandas
import pandas as pd
import numpy as np

In [6]:
#Pandas SERIES is like 1D array like object which works just like array
data = np.array([1,2,3,4,5])  #this is one single column, this is a series from array/list implementation
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [7]:
#Series from dict
data = {'a':1, "b":2}
series = pd.Series(data)
print(series)

a    1
b    2
dtype: int64

In [9]:
data = [1,2,3,4,5]
index = ['a','b','c','d','e']

series = pd.Series(data,index=index)
print(series)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
#DATAFRAME
data = [{'Name': 'madhur', 'Age': 22},{'Name': 'naman', 'Age': 22},{'Name': 'ashu', 'Age': 22}]
print(data)

df= pd.DataFrame(data)
print(df)

[{'Name': 'madhur', 'Age': 22}, {'Name': 'naman', 'Age': 22}, {'Name': 'ashu', 'Age': 22}]
     Name  Age
0  madhur   22
1   naman   22
2    ashu   22

In [14]:
data = [[1,2,3,4,5],[2,3,4,5,6]]
df= pd.DataFrame(data)
print(df)

   0  1  2  3  4
0  1  2  3  4  5
1  2  3  4  5  6

In [15]:
data = {
    'Name': ['MADHUR', 'ASHU', "NAMAN"],
    "AGE": [22,33,34]
}

df= pd.DataFrame(data)
print(df)

     Name  AGE
0  MADHUR   22
1    ASHU   33
2   NAMAN   34

In [17]:
data = pd.read_csv("data.csv")
print(data.head())

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [19]:
#LAst 5 rows of Dataframe
data.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [22]:
#Printing a specific column
data['Value']

0     28.0
1     39.0
2     32.0
3      8.0
4     26.0
5     54.0
6     16.0
7     89.0
8     37.0
9     22.0
10     7.0
11    60.0
12    70.0
13    69.0
14    47.0
15     NaN
16    93.0
17     NaN
18    31.0
19    59.0
20    82.0
21    37.0
22    62.0
23    92.0
24    24.0
25    95.0
26    71.0
27    56.0
28     NaN
29    51.0
30    50.0
31    17.0
32    63.0
33    27.0
34    70.0
35    60.0
36    36.0
37     2.0
38    94.0
39    62.0
40    15.0
41    97.0
42    93.0
43    43.0
44    96.0
45    99.0
46     6.0
47    69.0
48    65.0
49    11.0
Name: Value, dtype: float64

In [ ]:
#Row index in
data.loc[0:4]

Empty DataFrame
Columns: [Date, Category, Value, Product, Sales, Region]
Index: []

In [29]:
data.iloc[2:,4:].head(2)

   Sales Region
2  398.0   East
3  522.0   East

In [31]:
#Accessing a specific index in data frame
data.at[1,'Sales']

110.0

In [32]:
#Accessing specific index using iat
data.iat[2,3]

'Product2'

In [37]:
##Data manupulation with DataFrame
data.head(10)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
5  2023-01-06        B   54.0  Product3  192.0   West
6  2023-01-07        A   16.0  Product1  936.0   East
7  2023-01-08        C   89.0  Product1  488.0   West
8  2023-01-09        C   37.0  Product3  772.0   West
9  2023-01-10        A   22.0  Product2  834.0   West

In [41]:
#Adding a column in dataframe
df["SALARY"] = [10,20,30]
print(df)

     Name  AGE  SALARY
0  MADHUR   22      10
1    ASHU   33      20
2   NAMAN   34      30

In [42]:
#Deleting column from dataframe
df.drop("SALARY", axis=1, inplace=True)
print(df)


df.drop(0, inplace=True) #Drops first row

     Name  AGE
0  MADHUR   22
1    ASHU   33
2   NAMAN   34

In [44]:
df["AGE"] = df["AGE"]+1
print(df)

     Name  AGE
0  MADHUR   24
1    ASHU   35
2   NAMAN   36

In [51]:
df.dtypes
df.describe()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   AGE     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes